---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
source: html/becd0444-c844-b36d-2355-4c8fd9f1049d.htm
---
# EnergyAnalysisWindowType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.